artillery/trajectories/commands/create_trajectory.yml
config:
  target: 'https://lemonade.leersteun.lars-tst.school'
  phases:
    - duration: 1
      arrivalRate: 1  
      name: "Trajectory create commands"
  environments:
    tst:
      target: 'https://lemonade.leersteun.lars-tst.school'
      phases:
        - duration: 1
          arrivalRate: 1
      payload:
        path: '../../data/tst-questions-mongo.csv'
        fields:
          - 'question_id'
          - 'school_year' 
          - 'creation_date'
          - 'student_subscription_id'
          - 'verslag_id'
          - 'school_entity_id'
          - 'learning_support_center_id'
          - 'creator_id'
          - 'name' 
          - 'assignee_id'
        skipHeader: true
        delimiter: ','    
    acc:
      target: 'https://lemonade.leersteun.lars-acc.school'
      phases:
        - duration: 5
          arrivalRate: 20
      payload:
        path: '../../data/acc-questions-mongo.csv'
        fields:
          - 'question_id'
          - 'school_year' 
          - 'creation_date'
          - 'student_subscription_id'
          - 'verslag_id'
          - 'school_entity_id'
          - 'learning_support_center_id'
          - 'creator_id'
          - 'name' 
          - 'assignee_id'
        skipHeader: true
        delimiter: ','    
  variables:
    access_token: "{{ $env.ACCESS_TOKEN }}"
    mongo_claims: "{{ $env.MONGO_CLAIMS }}"
  processor: '../../utils/response-logger.js'

scenarios:
  - name: "Create Support Question from CSV"
    weight: 100
    flow:
      - log: 'Current environment is set to: {{ $environment }}'
      - post:
          url: '/api/zorglink/zorglink-trajectory/{{ question_id }}'
          headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
          json:
            _id: '{{ question_id }}'
            _corr: '{{ custom_uuid }}'
            _command: "put"
            _type: "zorglink-trajectory"
            assigneeId: '{{ assignee_id }}'
            name: '{{ name }} - {{ question_id }}'          
            supportQuestionId: '{{ question_id }}'
          beforeRequest: 'generateUuid'  
          afterResponse: 'logResponse'
          expect:
            - statusCode: 
                - 200
                - 201
            - contentType: json